tests/k6/stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Warm-up"
    - duration: 120
      arrivalRate: 100
      rampTo: 2000
      name: "Spike"
    - duration: 300
      arrivalRate: 2000
      name: "Sustained load"
    - duration: 180
      arrivalRate: 2000
      rampTo: 0
      name: "Cooldown"